data/workflowhub/tool_tool_graph.dot
digraph tool_tool_graph {
  rankdir=LR;
  graph [fontsize=12, fontname="Arial"];
  node [shape=box, style="rounded,filled", fillcolor="#F7FAFC", color="#4A5568", fontname="Arial"];
  edge [color="#4A5568", fontname="Arial"];
  n_bandage_image [label="Bandage Image"];
  n_bandage_info [label="Bandage Info"];
  n_bowtie2 [label="Bowtie2"];
  n_call_variants [label="Call variants"];
  n_collapse_collection [label="Collapse Collection"];
  n_convert [label="Convert"];
  n_create_assemblies_with_unicycler [label="Create assemblies with Unicycler"];
  n_cut [label="Cut"];
  n_fasttree [label="FASTTREE"];
  n_fastqc [label="FastQC"];
  n_faster_download_and_extract_reads_in_fastq [label="Faster Download and Extract Reads in FASTQ"];
  n_filter_sam_or_bam_output_sam_or_bam [label="Filter SAM or BAM, output SAM or BAM"];
  n_hyphy_gard [label="HyPhy-GARD"];
  n_hyphy_absrel [label="HyPhy-aBSREL"];
  n_mafft [label="MAFFT"];
  n_map_with_bwa_mem [label="Map with BWA-MEM"];
  n_map_with_minimap2 [label="Map with minimap2"];
  n_markduplicates [label="MarkDuplicates"];
  n_mergesamfiles [label="MergeSamFiles"];
  n_multiqc [label="MultiQC"];
  n_ncbi_accession_download [label="NCBI Accession Download"];
  n_nanoplot [label="NanoPlot"];
  n_normalizefasta [label="NormalizeFasta"];
  n_realign_reads [label="Realign reads"];
  n_remove_beginning [label="Remove beginning"];
  n_spades [label="SPAdes"];
  n_samtools_fastx [label="Samtools fastx"];
  n_samtools_stats [label="Samtools stats"];
  n_snpeff_build [label="SnpEff build:"];
  n_snpeff_eff [label="SnpEff eff:"];
  n_snpsift_extract_fields [label="SnpSift Extract Fields"];
  n_text_transformation [label="Text transformation"];
  n_fastp [label="fastp"];
  n_tranalign [label="tranalign"];
  n_transeq [label="transeq"];
  n_filter_sam_or_bam_output_sam_or_bam -> n_mergesamfiles [label="4"];
  n_mergesamfiles -> n_samtools_fastx [label="4"];
  n_fastp -> n_multiqc [label="4"];
  n_map_with_bwa_mem -> n_filter_sam_or_bam_output_sam_or_bam [label="3"];
  n_fastp -> n_map_with_bwa_mem [label="3"];
  n_call_variants -> n_snpeff_eff [label="2"];
  n_fastqc -> n_multiqc [label="2"];
  n_mafft -> n_tranalign [label="2"];
  n_map_with_minimap2 -> n_filter_sam_or_bam_output_sam_or_bam [label="2"];
  n_markduplicates -> n_multiqc [label="2"];
  n_markduplicates -> n_realign_reads [label="2"];
  n_realign_reads -> n_call_variants [label="2"];
  n_snpeff_build -> n_call_variants [label="2"];
  n_snpeff_build -> n_realign_reads [label="2"];
  n_snpeff_build -> n_snpeff_eff [label="2"];
  n_snpeff_eff -> n_snpsift_extract_fields [label="2"];
  n_snpsift_extract_fields -> n_collapse_collection [label="2"];
  n_transeq -> n_mafft [label="2"];
  n_bowtie2 -> n_markduplicates [label="1"];
  n_bowtie2 -> n_multiqc [label="1"];
  n_collapse_collection -> n_mafft [label="1"];
  n_convert -> n_cut [label="1"];
  n_create_assemblies_with_unicycler -> n_bandage_image [label="1"];
  n_create_assemblies_with_unicycler -> n_bandage_info [label="1"];
  n_cut -> n_ncbi_accession_download [label="1"];
  n_fasttree -> n_hyphy_absrel [label="1"];
  n_faster_download_and_extract_reads_in_fastq -> n_fastqc [label="1"];
  n_faster_download_and_extract_reads_in_fastq -> n_map_with_minimap2 [label="1"];
  n_faster_download_and_extract_reads_in_fastq -> n_nanoplot [label="1"];
  n_faster_download_and_extract_reads_in_fastq -> n_fastp [label="1"];
  n_filter_sam_or_bam_output_sam_or_bam -> n_markduplicates [label="1"];
  n_filter_sam_or_bam_output_sam_or_bam -> n_samtools_stats [label="1"];
  n_mafft -> n_fasttree [label="1"];
  n_ncbi_accession_download -> n_normalizefasta [label="1"];
  n_normalizefasta -> n_text_transformation [label="1"];
  n_remove_beginning -> n_convert [label="1"];
  n_spades -> n_bandage_image [label="1"];
  n_spades -> n_bandage_info [label="1"];
  n_samtools_stats -> n_multiqc [label="1"];
  n_snpeff_build -> n_bowtie2 [label="1"];
  n_snpeff_build -> n_map_with_bwa_mem [label="1"];
  n_text_transformation -> n_collapse_collection [label="1"];
  n_fastp -> n_bowtie2 [label="1"];
  n_tranalign -> n_fasttree [label="1"];
  n_tranalign -> n_hyphy_gard [label="1"];
  n_tranalign -> n_hyphy_absrel [label="1"];
}
